Tekla Open API Reference for Tekla Structures 2025
Part.PourPhase Property
 Gets or sets the pour phase of the part.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int PourPhase { get; set; }
Public Property PourPhase As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Part Class
Tekla.Structures.Model Namespace